#tap "homebrew/cask-fonts"
tap "jmalloc/grit"
tap "raggi/ale"

brew "colordiff"
brew "composer"
brew "git"
brew "go"
brew "grit"
brew "jq"
brew "less"
brew "node"
brew "openssl-osx-ca", restart_service: :changed
brew "php"
brew "protobuf"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"

cask "docker"
cask "dotnet-sdk"
cask "epic-games"
cask "firefox"
#cast "font-meslo-for-powerline"
#cask "gog-galaxy"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "macvim"
cask "minecraft"
cask "slack"
cask "spotify"
cask "steam"
#cask "thunderbird"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"

mas "Evernote", id: 406056744
mas "Magnet", id: 441258766
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
#mas "Xcode", id: 497799835
