tap "homebrew/cask-fonts"
tap "jmalloc/grit"
tap "raggi/ale"  # for openssl-osx-ca

brew "colordiff"
#brew "composer"
brew "git"
brew "git-lfs"  # will need to do: git lfs install
brew "go"
brew "grit"
brew "jq"  # can't remember what this is for
brew "less"
#brew "minikube"
#brew "mono"  # doesn't yet support Apple Silicon's Ventura?
brew "node"
brew "openssl-osx-ca", restart_service: :changed
#brew "php"
brew "protobuf"
#brew remotemobprogramming/brew/mob
brew "tree"
#brew "vim"  # conflicts with MacVim
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"

#cask "android-studio"
cask "around"
cask "blender"
cask "discord"
cask "docker"
cask "dotnet-sdk"
#cask "epic-games"
cask "firefox"
cask "font-meslo-for-powerline"
cask "gimp"
#cask "gog-galaxy"
#cask "google-backup-and-sync"
#cask "google-drive"
cask "google-chrome"
cask "iterm2"
cask "joplin"
#cask "kdenlive"
cask "macvim"
#cask "minecraft"
#cask "scroll-reverser"
#cask "sidequest"
cask "spotify"
cask "steam"
#cask "thunderbird"
cask "tunnelblick"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"

mas "Magnet", id: 441258766
#mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
